{
    "experiments": [
        {
            "name": "test",
            "game_instances": [
                {
                    "game_id": 0,
                    "nodes": [
                        "(0, 0)",
                        "(1, 0)",
                        "(1, 2)",
                        "(1, 1)",
                        "(2, 1)"
                    ],
                    "edges": [
                        "((0, 0), (1, 0))",
                        "((1, 0), (0, 0))",
                        "((1, 0), (1, 1))",
                        "((1, 1), (1, 0))",
                        "((1, 1), (2, 1))",
                        "((2, 1), (1, 1))",
                        "((1, 1), (1, 2))",
                        "((1, 2), (1, 1))"
                    ],
                    "imgs": {
                        "(0, 0)": "https://www.ling.uni-potsdam.de/clembench/adk/images/ADE/training/urban/street/ADE_train_00016858.jpg",
                        "(0, 1)": "https://www.ling.uni-potsdam.de/clembench/adk/images/ADE/training/work_place/reception/ADE_train_00015716.jpg",
                        "(1, 1)": "https://www.ling.uni-potsdam.de/clembench/adk/images/ADE/training/home_or_hotel/bedroom/ADE_train_00000526.jpg",
                        "(1, 2)": "https://www.ling.uni-potsdam.de/clembench/adk/images/ADE/training/urban/casino__outdoor/ADE_train_00005212.jpg",
                        "(2, 1)": "https://www.ling.uni-potsdam.de/clembench/adk/images/ADE/training/home_or_hotel/shower/ADE_train_00016280.jpg"

                    },
                    "cats": {
                        "(0, 0)": "street",
                        "(0, 1)": "reception",
                        "(1, 1)": "bedroom",
                        "(1, 2)": "casino",
                        "(2, 1)": "shower"
                    },
                    "start": "(0, 0)",
                    "player1_prompt": "You are stuck in a mapworld environment. Your task is to explore this world and reach an escape room. I have an image of the escape room, I'll describe it to you. Based on the description, check the image you have been provided that corresponds to the room you are in right now. Now you have 3 options Option 1 is to explore this room further, If you want to choose this option start your response with <DESCRIPTION>: tag, then I'll respond with a similar tag with more detailed description. Option 2 is to explore another room. You can move to Rooms : $ROOMS (First pat is the room name, and second is the direction). If you want to move to any of these rooms start your response with the tag <SUGGESTION>: DIRECTION. Replace the word DIRECTON with one of {north, south, east ,west} depending on which direction you can actually go. Your Final option is when you think this is the escape room and you want to escape. Then simply respond with one tag <ESCAPE>. Here is my initial Description: $DESCRIPTION which option do you choose?",
                    "player2_prompt": "You are a trusted ally of an agent who is stuck in a mapworld. The agent can move about the world and go to different rooms. You are given an image that is the room that agent needs to reach. Start with generating an initial description of the room you are in. Start your response with tag <DESCRIPTION>: your_respone. Provide only the description in the above format and nothing else and wait for a response from the agent. The agent can ask for two things from you. 1) More detailed description of the room, then again start with the tag <DESCRIPTION>: and your description. 2) Suggestion to move to another room, then respond with the tag <SUGGESTION>: and your suggestion - which can be only one of {north, south, east, west}"
                }
            ]
        }
    ]
}

